=begin
  假设你是一位很棒的家长，想要给你的孩子们一些小饼干。但是，每个孩子最多只能给一块饼干。对每个孩子 i ，都有一个胃口值 gi ，这是能让孩子们满足胃口的饼干的最小尺寸；并且每块饼干 j ，都有一个尺寸 sj 。如果 sj >= gi ，我们可以将这个饼干 j 分配给孩子 i ，这个孩子会得到满足。你的目标是尽可能满足越多数量的孩子，并输出这个最大数值。
  注意：
  你可以假设胃口值为正。
  一个小朋友最多只能拥有一块饼干。
=end


#解法一、使用贪心算法
#只需要关注可以满足的小朋友的数量即可，没满足一个小朋友，则小朋友的数组下标向后移动一位
def find_content_children(g, s)
  g.sort!
  s.sort!
  i, j = 0, 0
  while i < g.length && j < s.length
    #如果饼干可以满足孩子的胃口，则计数加1
    i += 1 if g[i] <= s[j]
    #无论是否满足当前孩子的胃口，饼干的下标都需要往后移动1位
    j += 1
  end
  return i
end