package com.leetcode.base.week07;

public class ReverseBits {
    //位移运算符工作中基本用不上，都是看底层源码会有，总结如下：
    //左移运算符：<<
    //将操作数的二进制码整体左移指定位数，左移后，右边空出来的位用0填补。
    //右移运算符：>>
    //将操作数的二进制码整体右移指定位数，右移后，左边空出来的位用原来的符号位填补，
    // 即若原来是正数，则符号位为0，则左边空出来的位用0填补；
    // 若原来是负数，则符号位为1，则左边空出来的位用1填补。
    //无符号右移运算符：>>>
    //相比于右移运算符，无符号右移运算符右移后，左边空出来的位总是用0填补。
    public int reverseBits(int n) {
        int res = 0;
        for (int i = 0; i < 32; i++) {
            int digit = (n >> i) & 1;
            digit <<= (31 - i);
            res |= digit;
        }
        return res;
    }
}
